# Brewfile - Homebrew Bundle
# Install with: brew bundle --file=~/src/personal/dotfiles/Brewfile

# =============================================================================
# Core Shell & Terminal
# =============================================================================
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-syntax-highlighting"

# =============================================================================
# Version Management
# =============================================================================
brew "mise"                    # Runtime version manager (Ruby, Node, Python, etc.)

# =============================================================================
# Git & Version Control
# =============================================================================
brew "git"
brew "gh"                      # GitHub CLI
brew "git-delta"               # Better git diff
brew "lazygit"                 # Terminal UI for git
brew "gnupg"                   # GPG for commit signing
brew "pinentry-mac"            # GPG pinentry for macOS
brew "diffr"

# =============================================================================
# Modern CLI Replacements
# =============================================================================
brew "ripgrep"                 # rg - fast grep replacement
brew "fd"                      # fd - fast find replacement
brew "bat"                     # cat with syntax highlighting
brew "eza"                     # ls replacement (formerly exa)
brew "fzf"                     # Fuzzy finder
brew "zoxide"                  # Smarter cd command
brew "htop"                    # Better top
brew "tldr"                    # Simplified man pages

# =============================================================================
# JSON/YAML/Data Processing
# =============================================================================
brew "jq"                      # JSON processor
brew "yq"                      # YAML processor

# =============================================================================
# Development Tools
# =============================================================================
brew "curl"
brew "wget"
brew "openssl"
brew "libpq"                   # PostgreSQL client libraries

# =============================================================================
# Docker & Containers
# =============================================================================
cask "orbstack"

# =============================================================================
# Applications
# =============================================================================
cask "visual-studio-code"
cask "google-chrome"
cask "iterm2"
cask "1password"
cask "1password-cli"
cask "slack"
cask "signal"
cask "zoom"
cask "notion"

# =============================================================================
# AI
# =============================================================================
brew "amp"
cask "chatgpt"
cask "claude-code"

# =============================================================================
# Fonts
# =============================================================================
cask "font-meslo-lg-nerd-font" # Powerlevel10k recommended font
cask "font-fira-code-nerd-font"
cask "font-jetbrains-mono-nerd-font"

# =============================================================================
# QuickLook Plugins
# =============================================================================
cask "qlmarkdown"              # Preview Markdown
cask "syntax-highlight"        # Preview code with syntax highlighting
cask "qlstephen"               # Preview plain text files without extension
